btcven/cortex-debug-cc26xx-cc13xx/data/cc2640r2f.svd
This register contains power management related bitfields for the MCU domain.</description>
          <fields>
            <field>
              <name>RESERVED18</name>
              <description>[31:18] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>VIRT_OFF</name>
              <description>[17:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>FIXED_WU_EN</name>
              <description>[16:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[15:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SRAM_RET_EN</name>
              <description>[3:0] MCU SRAM is partitioned into 4 banks . This register controls which of the banks that has retention during MCU power off</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RET_FULL</name>
                  <value>15</value>
                  <description>Retention on for all banks (SRAM:BANK0, SRAM:BANK1 ,SRAM:BANK2 and SRAM:BANK3)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_LEVEL3</name>
                  <value>7</value>
                  <description>Retention on for SRAM:BANK0, SRAM:BANK1 and SRAM:BANK2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_LEVEL2</name>
                  <value>3</value>
                  <description>Retention on for SRAM:BANK0 and SRAM:BANK1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_LEVEL1</name>
                  <value>1</value>
                  <description>Retention on for SRAM:BANK0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_NONE</name>
                  <value>0</value>
                  <description>Retention is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>AUXCFG</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>AUX Configuration

This register contains power management related signals for the AUX domain.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RAM_RET_EN</name>
              <description>[0:0] This bit controls retention mode for the AUX_RAM:BANK0:

0: Retention is disabled
1: Retention is enabled

NB: If retention is disabled, the AUX_RAM will be powered off when it would otherwise be put in retention mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>AUXCTL</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>AUX Control

This register contains events and control signals for the AUX domain.</description>
          <fields>
            <field>
              <name>RESET_REQ</name>
              <description>[31:31] Reset request for AUX. Writing 1 to this register will assert reset to AUX. The reset will be held until the bit is cleared again.

0: AUX reset pin will be deasserted
1: AUX reset pin will be asserted</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[30:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SCE_RUN_EN</name>
              <description>[2:2] Enables (1) or disables (0) AUX_SCE execution. AUX_SCE execution will begin when AUX Domain is powered and either this or AUX_SCE:CTL.CLK_EN is set. 

Setting this bit will assure that AUX_SCE execution starts as soon as AUX power domain is woken up. (  AUX_SCE:CTL.CLK_EN will be reset to 0 if AUX power domain has been off)

0: AUX_SCE execution will be disabled if AUX_SCE:CTL.CLK_EN is 0
1: AUX_SCE execution is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SWEV</name>
              <description>[1:1] Writing 1 sets the software event to the AUX domain, which can be read through AUX_WUC:WUEVFLAGS.AON_SW.

This event is normally cleared by AUX_SCE through the AUX_WUC:WUEVCLR.AON_SW. It can also be cleared by writing 0 to this register.

