btcven/cortex-debug-cc26xx-cc13xx/data/cc2640r2f.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_DDI0_OSC</name>
      <baseAddress>0x400CA000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>This is the DDI for the digital block that controls all the analog clock oscillators  (OSC_DIG) and performs qualification of the clocks generated.</description>
      <registers>
        <register>
          <name>CTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Control 0
Controls clock source selects</description>
          <fields>
            <field>
              <name>XTAL_IS_24M</name>
              <description>[31:31] Set based on the accurate high frequency XTAL.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24M</name>
                  <value>1</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48M</name>
                  <value>0</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED30</name>
              <description>[30:30] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>BYPASS_XOSC_LF_CLK_QUAL</name>
              <description>[29:29] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>BYPASS_RCOSC_LF_CLK_QUAL</name>
              <description>[28:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>DOUBLER_START_DURATION</name>
              <description>[27:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>DOUBLER_RESET_DURATION</name>
              <description>[25:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>RESERVED23</name>
              <description>[24:23] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>FORCE_KICKSTART_EN</name>
              <description>[22:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>[21:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>ALLOW_SCLK_HF_SWITCHING</name>
              <description>[16:16] 0: Default - Switching of HF clock source is disabled .
1: Allows switching of sclk_hf source.

Provided to prevent switching of the SCLK_HF source when running from flash (a long period during switching could corrupt flash). When sclk_hf  switching is disabled, a new source can be started when SCLK_HF_SRC_SEL is changed, but the switch will not occur until this bit is set.  This bit should be set to enable clock switching after STAT0.PENDINGSCLKHFSWITCHING indicates  the new HF clock is ready. When switching completes (also indicated by STAT0.PENDINGSCLKHFSWITCHING)  sclk_hf switching should be disabled to prevent flash corruption.  Switching should not be enabled when running from flash.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED15</name>
              <description>[15:15] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>HPOSC_MODE_EN</name>
              <description>[14:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RESERVED13</name>
              <description>[13:13] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>RCOSC_LF_TRIMMED</name>
              <description>[12:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_POWER_MODE</name>
              <description>[11:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>XOSC_LF_DIG_BYPASS</name>
              <description>[10:10] Bypass XOSC_LF and use the digital input clock from AON for the xosc_lf clock.

0: Use 32kHz XOSC as xosc_lf clock source
1: Use digital input (from AON) as xosc_lf clock source.

This bit will only have effect when SCLK_LF_SRC_SEL is selecting the xosc_lf as the sclk_lf source. The muxing performed by this bit is not glitch free. The following procedure must be followed when changing this field to avoid glitches on sclk_lf.

1) Set SCLK_LF_SRC_SEL to select any source other than the xosc_lf clock source.
2) Set or clear this bit to bypass or not bypass the xosc_lf.
3) Set SCLK_LF_SRC_SEL to use xosc_lf.

It is recommended that either the rcosc_hf or xosc_hf (whichever is currently active) be selected as the source in step 1 above. This provides a faster clock change.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CLK_LOSS_EN</name>
              <description>[9:9] Enable clock loss detection and hence the indicators to system controller.  Checks both SCLK_HF and SCLK_LF clock loss indicators.

0: Disable
1: Enable

Clock loss detection must be disabled when changing the sclk_lf source.  STAT0.SCLK_LF_SRC can be polled to determine when a change to a new sclk_lf source has completed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>ACLK_TDC_SRC_SEL</name>
              <description>[8:7] Source select for aclk_tdc.

00: RCOSC_HF (48MHz)
01: RCOSC_HF (24MHz)
10: XOSC_HF (24MHz)
11: Not used</description>
              <bitWidth>2</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>ACLK_REF_SRC_SEL</name>
              <description>[6:5] Source select for aclk_ref

