btcven/cortex-debug-cc26xx-cc13xx/data/cc2640r2f.svd
Write a value to CNT to capture the value of the 16-bit prescaler counter into CNT. Read CNT to get the captured value. 

The read value gets 1 LSB uncertainty if the event source level rises when you release the reset.

You must capture the prescaler counter value when the event source level is stable, either high or low:
- Disable AUX I/O input buffer to clamp AUXIO event low.
- Disable COMPA to clamp AUX_COMPA event low. 
The read value can in general get 1 LSB uncertainty when you gate the event source asynchronously.

Please note the following:
- The prescaler counter is reset to 2 by PRECTL.RESET_N.
- The captured value is 2 when the number of rising edges on prescaler input is less than 3. Otherwise, captured value equals number of event pulses - 1.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_TIMER</name>
      <baseAddress>0x400C7000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Timer</description>
      <registers>
        <register>
          <name>T0CFG</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Timer 0 Configuration</description>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>TICK_SRC_POL</name>
              <description>[13:13] Tick source polarity for Timer 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALL</name>
                  <value>1</value>
                  <description>Count on falling edges of TICK_SRC.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <value>0</value>
                  <description>Count on rising edges of TICK_SRC.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TICK_SRC</name>
              <description>[12:8] Select Timer 0 tick source from the synchronous event bus.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_IRQ</name>
                  <value>31</value>
                  <description>AUX_EVCTL:EVSTAT1.ADC_IRQ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_EVENT</name>
                  <value>30</value>
                  <description>AUX_EVCTL:EVSTAT1.MCU_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK_REF</name>
                  <value>29</value>
                  <description>AUX_EVCTL:EVSTAT1.ACLK_REF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO15</name>
                  <value>28</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO14</name>
                  <value>27</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO13</name>
                  <value>26</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO12</name>
                  <value>25</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO11</name>
                  <value>24</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO10</name>
                  <value>23</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO9</name>
                  <value>22</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO8</name>
                  <value>21</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <value>20</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <value>19</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <value>18</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <value>17</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <value>16</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <value>15</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <value>14</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <value>13</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG_WU</name>
                  <value>12</value>
                  <description>AUX_EVCTL:EVSTAT0.AON_PROG_WU</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_SW</name>
                  <value>11</value>
                  <description>AUX_EVCTL:EVSTAT0.AON_SW</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX1</name>
                  <value>10</value>
                  <description>AUX_EVCTL:EVSTAT0.OBSMUX1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX0</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT0.OBSMUX0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_4KHZ</name>
                  <value>8</value>
                  <description>AON_RTC:SUBSEC.VALUE bit 19. AON_RTC:CTL.RTC_4KHZ_EN enables this event.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DONE</name>
                  <value>7</value>
                  <description>AUX_EVCTL:EVSTAT0.ADC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMPH_AUTOTAKE_DONE</name>
                  <value>6</value>
                  <description>AUX_EVCTL:EVSTAT0.SMPH_AUTOTAKE_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1_EV</name>
                  <value>5</value>
                  <description>AUX_EVCTL:EVSTAT0.TIMER1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDC_DONE</name>
                  <value>3</value>
                  <description>AUX_EVCTL:EVSTAT0.TDC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>2</value>
                  <description>AUX_EVCTL:EVSTAT0.AUX_COMPB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>1</value>
                  <description>AUX_EVCTL:EVSTAT0.AUX_COMPA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH2_EV</name>
                  <value>0</value>
                  <description>AUX_EVCTL:EVSTAT0.AON_RTC_CH2</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRE</name>
              <description>[7:4] Prescaler division ratio is 2^PRE:

0x0: Divide by 1.
0x1: Divide by 2.
0x2: Divide by 4.
... 
0xF: Divide by 32,768.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[3:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MODE</name>
              <description>[1:1] Timer 0 mode.

