btcven/cortex-debug-cc26xx-cc13xx/data/cc2640r2f.svd
Note: When VALUE is less than 2, Timer 0 counter value remains 0. AUX_TIMER0_EV goes high and remains high 1 AUX clock period after you enable the timer.


It is allowed to update the VALUE while the timer runs.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T1TARGET</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Timer 1 Target

Timer 1 counter target value</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[7:0] Timer 1 target value.

Manual Reload Mode:
- Timer 1 increments until the counter value becomes equal to or greater than VALUE. 
- AUX_TIMER1_EV pulses high for 1 AUX clock period when the counter value is equal to or greater than VALUE.

Note: When VALUE is 0, Timer 1 counts to 1. AUX_TIMER1_EV pulses high for 1 AUX clock period.

Continuous Reload Mode:
- Timer 1 increments until the counter value becomes equal to or greater than ( VALUE - 1), then restarts from 0.
- AUX_TIMER1_EV pulses high for 1 AUX clock period when the counter value is 0, except for when you enable the timer.

Note: When VALUE is less than 2, Timer 1 counter value remains 0. AUX_TIMER1_EV goes high and remains high 1 AUX clock period after you enable the timer.


It is allowed to update the VALUE while the timer runs.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T1CTL</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Timer 1 Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Timer 1 enable.

0: Disable Timer 1.
1: Enable Timer 1.

The counter restarts from 0 when you enable Timer 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_WUC</name>
      <baseAddress>0x400C6000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Wake-up controller</description>
      <registers>
        <register>
          <name>MODCLKEN0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Module Clock Enable

Clock enable for each module in the AUX domain

For use by the system CPU

The settings in this register are OR'ed with the corresponding settings in MODCLKEN1. This allows the system CPU and AUX_SCE to request clocks independently. Settings take effect immediately.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUX_ADI4</name>
              <description>[7:7] Enables (1) or disables (0) clock for AUX_ADI4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>System CPU has requested clock for AUX_ADI4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>System CPU has not requested clock for AUX_ADI4</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_DDI0_OSC</name>
              <description>[6:6] Enables (1) or disables (0) clock for AUX_DDI0_OSC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>System CPU has requested clock for AUX_DDI0_OSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>System CPU has not requested clock for AUX_DDI0_OSC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDC</name>
              <description>[5:5] Enables (1) or disables (0) clock for AUX_TDCIF. 

Note that the TDC counter and reference clock sources must be requested separately using TDCCLKCTL and REFCLKCTL, respectively.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>System CPU has requested clock for TDC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>System CPU has not requested clock for TDC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAIF</name>
              <description>[4:4] Enables (1) or disables (0) clock for AUX_ANAIF.

Note that the ADC internal clock must be requested separately using ADCCLKCTL.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>System CPU has requested clock for ANAIF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>System CPU has not requested clock for ANAIF</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER</name>
              <description>[3:3] Enables (1) or disables (0) clock for AUX_TIMER.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>System CPU has requested clock for TIMER</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>System CPU has not requested clock for TIMER</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIODIO1</name>
              <description>[2:2] Enables (1) or disables (0) clock for AUX_AIODIO1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>System CPU has requested clock for AIODIO1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>System CPU has not requested clock for AIODIO1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIODIO0</name>
              <description>[1:1] Enables (1) or disables (0) clock for AUX_AIODIO0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>System CPU has requested clock for AIODIO0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>System CPU has not requested clock for AIODIO0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPH</name>
              <description>[0:0] Enables (1) or disables (0) clock for AUX_SMPH.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>System CPU has requested clock for SMPH</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>System CPU has not requested clock for SMPH</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PWROFFREQ</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Power Off Request

Requests power off request for the AUX domain. When powered off, the power supply and clock is disabled. This may only be used when taking the entire device into shutdown mode (i.e. with full device reset when resuming operation).

Power off is prevented if AON_WUC:AUXCTL.AUX_FORCE_ON has been set, or if MCUBUSCTL.DISCONNECT_REQ has been cleared.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>REQ</name>
              <description>[0:0] Power off request

