btcven/cortex-debug-cc26xx-cc13xx/data/cc2640r2f.svd
0: No action
1: Request to power down AUX. Once set, this bit shall not be cleared. The bit will be reset again when AUX is powered up again.

The request will only happen if AONCTLSTAT.AUX_FORCE_ON = 0 and MCUBUSSTAT.DISCONNECTED=1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PWRDWNREQ</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Power Down Request

Request from AUX for system to enter power down. When system is in power down there is limited current supply available and the clock source is set by AON_WUC:AUXCLK.PWR_DWN_SRC</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>REQ</name>
              <description>[0:0] Power down request

0: Request for system to be in active mode
1: Request for system to be in power down mode

When REQ is 1 one shall assume that the system is in power down, and that current supply is limited. When setting REQ = 0, one shall assume that the system is in power down until  PWRDWNACK.ACK = 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PWRDWNACK</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Power Down Acknowledgment</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ACK</name>
              <description>[0:0] Power down acknowledgment. Indicates whether the power down request given by PWRDWNREQ.REQ is captured by the AON domain or not

0: AUX can assume that the system is in active mode
1: The request for power down is acknowledged and the AUX must act like the system is in power down mode and power supply is limited

The system CPU cannot use this bit since the bus bridge between MCU domain and AUX domain is always disconnected when this bit is set. For AUX_SCE use only</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLKLFREQ</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Low Frequency Clock Request</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>REQ</name>
              <description>[0:0] Low frequency request 

0: Request clock frequency to be controlled by AON_WUC:AUXCLK and the system state
1: Request low frequency clock SCLK_LF as the clock source for AUX

This bit must not be modified unless CLKLFACK.ACK matches the current value</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLKLFACK</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Low Frequency Clock Acknowledgment</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ACK</name>
              <description>[0:0] Acknowledgment of CLKLFREQ.REQ

0: Acknowledgement that clock frequency is controlled by AON_WUC:AUXCLK and the system state
1: Acknowledgement that the low frequency clock SCLK_LF is the clock source for AUX</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>WUEVFLAGS</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Wake-up Event Flags

Status of wake-up events from the AON domain

The event flags are cleared by setting the corresponding bits in WUEVCLR</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AON_RTC_CH2</name>
              <description>[2:2] Indicates pending event from AON_RTC_CH2 compare. Note that this flag will be set whenever the AON_RTC_CH2 event happens, but that does not mean that this event is a wake-up event. To make the AON_RTC_CH2 a wake-up event for the AUX domain configure it as a wake-up event in AON_EVENT:AUXWUSEL.WU0_EV, AON_EVENT:AUXWUSEL.WU1_EV or AON_EVENT:AUXWUSEL.WU2_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AON_SW</name>
              <description>[1:1] Indicates pending event triggered by system CPU writing a 1 to AON_WUC:AUXCTL.SWEV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AON_PROG_WU</name>
              <description>[0:0] Indicates pending event triggered by the sources selected in AON_EVENT:AUXWUSEL.WU0_EV, AON_EVENT:AUXWUSEL.WU1_EV and AON_EVENT:AUXWUSEL.WU2_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>WUEVCLR</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Wake-up Event Clear

Clears wake-up events from the AON domain</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AON_RTC_CH2</name>
              <description>[2:2] Set to clear the WUEVFLAGS.AON_RTC_CH2 wake-up event. Note that if RTC channel 2 is also set as source for AON_PROG_WU this field can also clear WUEVFLAGS.AON_PROG_WU

This bit must remain set until WUEVFLAGS.AON_RTC_CH2 returns to 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AON_SW</name>
              <description>[1:1] Set to clear the WUEVFLAGS.AON_SW wake-up event. 

This bit must remain set until WUEVFLAGS.AON_SW returns to 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AON_PROG_WU</name>
              <description>[0:0] Set to clear the WUEVFLAGS.AON_PROG_WU wake-up event. Note only if an IO event is selected as wake-up event, is it possible to use this field to clear the source. Other sources cannot be cleared using this field.

The IO pin needs to be assigned to AUX in the IOC and the input enable for the pin needs to be set in AIODIO0 or AIODIO1 for this clearing to take effect.

