btcven/cortex-debug-cc26xx-cc13xx/data/cc2640r2f.svd
NOTE! If using the following functions this field must be configured (used by TI RTOS):
SysCtrlSetRechargeBeforePowerDown() SysCtrlAdjustRechargeAfterPowerDown()</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>VOLT_LOAD_0</name>
          <addressOffset>0xfb8</addressOffset>
          <size>32</size>
          <description>Voltage Load 0
Enabled by MODE_CONF.VDDR_EXT_LOAD.</description>
          <fields>
            <field>
              <name>VDDR_EXT_TP45</name>
              <description>[31:24] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>VDDR_EXT_TP25</name>
              <description>[23:16] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VDDR_EXT_TP5</name>
              <description>[15:8] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>VDDR_EXT_TM15</name>
              <description>[7:0] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>VOLT_LOAD_1</name>
          <addressOffset>0xfbc</addressOffset>
          <size>32</size>
          <description>Voltage Load 1
Enabled by MODE_CONF.VDDR_EXT_LOAD.</description>
          <fields>
            <field>
              <name>VDDR_EXT_TP125</name>
              <description>[31:24] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>VDDR_EXT_TP105</name>
              <description>[23:16] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VDDR_EXT_TP85</name>
              <description>[15:8] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>VDDR_EXT_TP65</name>
              <description>[7:0] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>RTC_OFFSET</name>
          <addressOffset>0xfc0</addressOffset>
          <size>32</size>
          <description>Real Time Clock Offset
Enabled by MODE_CONF.RTC_COMP.</description>
          <fields>
            <field>
              <name>RTC_COMP_P0</name>
              <description>[31:16] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RTC_COMP_P1</name>
              <description>[15:8] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RTC_COMP_P2</name>
              <description>[7:0] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>FREQ_OFFSET</name>
          <addressOffset>0xfc4</addressOffset>
          <size>32</size>
          <description>Frequency Offset</description>
          <fields>
            <field>
              <name>HF_COMP_P0</name>
              <description>[31:16] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>HF_COMP_P1</name>
              <description>[15:8] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HF_COMP_P2</name>
              <description>[7:0] Reserved for future use. Software should not rely on the value of a reserved. Writing any other value than the reset/default value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>IEEE_MAC_0</name>
          <addressOffset>0xfc8</addressOffset>
          <size>32</size>
          <description>IEEE MAC Address 0</description>
          <fields>
            <field>
              <name>ADDR</name>
              <description>[31:0] Bits[31:0] of the 64-bits custom IEEE MAC address.
If different from 0xFFFFFFFF then the value of this field is applied; otherwise use value from FCFG.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>IEEE_MAC_1</name>
          <addressOffset>0xfcc</addressOffset>
          <size>32</size>
          <description>IEEE MAC Address 1</description>
          <fields>
            <field>
              <name>ADDR</name>
              <description>[31:0] Bits[63:32] of the 64-bits custom IEEE MAC address.
If different from 0xFFFFFFFF then the value of this field is applied; otherwise use value from FCFG.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>IEEE_BLE_0</name>
          <addressOffset>0xfd0</addressOffset>
          <size>32</size>
          <description>IEEE BLE Address 0</description>
          <fields>
            <field>
              <name>ADDR</name>
              <description>[31:0] Bits[31:0] of the 64-bits custom IEEE BLE address.
If different from 0xFFFFFFFF then the value of this field is applied; otherwise use value from FCFG.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>IEEE_BLE_1</name>
          <addressOffset>0xfd4</addressOffset>
          <size>32</size>
          <description>IEEE BLE Address 1</description>
          <fields>
            <field>
              <name>ADDR</name>
              <description>[31:0] Bits[63:32] of the 64-bits custom IEEE BLE address.
If different from 0xFFFFFFFF then the value of this field is applied; otherwise use value from FCFG.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>BL_CONFIG</name>
          <addressOffset>0xfd8</addressOffset>
          <size>32</size>
          <description>Bootloader Configuration
Configures the functionality of the ROM boot loader.
If both the boot loader is enabled by the BOOTLOADER_ENABLE field and the boot loader backdoor is enabled by the BL_ENABLE field it is possible to force entry of the ROM boot loader even if a valid image is present in flash.</description>
          <fields>
            <field>
              <name>BOOTLOADER_ENABLE</name>
              <description>[31:24] Bootloader enable. Boot loader can be accessed if IMAGE_VALID_CONF.IMAGE_VALID is non-zero or BL_ENABLE is enabled (and conditions for boot loader backdoor are met).
0xC5: Boot loader is enabled.
Any other value: Boot loader is disabled.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED</name>
              <description>[23:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>BL_LEVEL</name>
              <description>[16:16] Sets the active level of the selected DIO number BL_PIN_NUMBER if boot loader backdoor is enabled by the BL_ENABLE field.
0: Active low.
1: Active high.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>BL_PIN_NUMBER</name>
              <description>[15:8] DIO number that is level checked if the boot loader backdoor is enabled by the BL_ENABLE field.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BL_ENABLE</name>
              <description>[7:0] Enables the boot loader backdoor.
0xC5: Boot loader backdoor is enabled.
Any other value: Boot loader backdoor is disabled.

NOTE! Boot loader must be enabled (see BOOTLOADER_ENABLE) if boot loader backdoor is enabled.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xC5FFFFFF</resetValue>
        </register>
        <register>
          <name>ERASE_CONF</name>
          <addressOffset>0xfdc</addressOffset>
          <size>32</size>
          <description>Erase Configuration</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>CHIP_ERASE_DIS_N</name>
              <description>[8:8] Chip erase.
This bit controls if a chip erase requested through the JTAG WUC TAP will be ignored in a following boot caused by a reset of the MCU VD.
A successful chip erase operation will force the content of the flash main bank back to the state as it was when delivered by TI. 
0: Disable. Any chip erase request detected during boot will be ignored.
1: Enable. Any chip erase request detected during boot will be performed by the boot FW.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>BANK_ERASE_DIS_N</name>
              <description>[0:0] Bank erase.
This bit controls if the ROM serial boot loader will accept a received Bank Erase command (COMMAND_BANK_ERASE).
A successful Bank Erase operation will erase all main bank sectors not protected by write protect configuration bits in CCFG.
0: Disable the boot loader bank erase function.
1: Enable the boot loader bank erase function.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CCFG_TI_OPTIONS</name>
          <addressOffset>0xfe0</addressOffset>
          <size>32</size>
          <description>TI Options</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TI_FA_ENABLE</name>
              <description>[7:0] TI Failure Analysis.
0xC5: Enable the functionality of unlocking the TI FA (TI Failure Analysis) option with the unlock code.
All other values: Disable the functionality of unlocking the TI FA option with the unlock code.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFC5</resetValue>
        </register>
        <register>
          <name>CCFG_TAP_DAP_0</name>
          <addressOffset>0xfe4</addressOffset>
          <size>32</size>
          <description>Test Access Points Enable 0</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>CPU_DAP_ENABLE</name>
              <description>[23:16] Enable CPU DAP.
0xC5: Main CPU DAP access is enabled during power-up/system-reset by ROM boot FW.
Any other value: Main CPU DAP access will remain disabled out of power-up/system-reset.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PRCM_TAP_ENABLE</name>
              <description>[15:8] Enable PRCM TAP.
0xC5: PRCM TAP access is enabled during power-up/system-reset by ROM boot FW if enabled by corresponding configuration value in FCFG1 defined by TI.
Any other value: PRCM TAP access will remain disabled out of power-up/system-reset.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TEST_TAP_ENABLE</name>
              <description>[7:0] Enable Test TAP.
0xC5: TEST TAP access is enabled during power-up/system-reset by ROM boot FW if enabled by corresponding configuration value in FCFG1 defined by TI.
Any other value: TEST TAP access will remain disabled out of power-up/system-reset.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFC5C5C5</resetValue>
        </register>
        <register>
          <name>CCFG_TAP_DAP_1</name>
          <addressOffset>0xfe8</addressOffset>
          <size>32</size>
          <description>Test Access Points Enable 1</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>PBIST2_TAP_ENABLE</name>
              <description>[23:16] Enable PBIST2 TAP.
0xC5: PBIST2 TAP access is enabled during power-up/system-reset by ROM boot FW if enabled by corresponding configuration value in FCFG1 defined by TI.
Any other value: PBIST2 TAP access will remain disabled out of power-up/system-reset.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PBIST1_TAP_ENABLE</name>
              <description>[15:8] Enable PBIST1 TAP.
0xC5: PBIST1 TAP access is enabled during power-up/system-reset by ROM boot FW if enabled by corresponding configuration value in FCFG1 defined by TI.
Any other value: PBIST1 TAP access will remain disabled out of power-up/system-reset.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>WUC_TAP_ENABLE</name>
              <description>[7:0] Enable WUC TAP
0xC5: WUC TAP access is enabled during power-up/system-reset by ROM boot FW if enabled by corresponding configuration value in FCFG1 defined by TI.
Any other value: WUC TAP access will remain disabled out of power-up/system-reset.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFC5C5C5</resetValue>
        </register>
        <register>
          <name>IMAGE_VALID_CONF</name>
          <addressOffset>0xfec</addressOffset>
          <size>32</size>
          <description>Image Valid</description>
          <fields>
            <field>
              <name>IMAGE_VALID</name>
              <description>[31:0] This field must have a value of 0x00000000 in order for enabling the boot sequence to transfer control to a flash image.
A non-zero value forces the boot sequence to call the boot loader.

For CC2640R2:
This field must have the address value of the start of the flash vector table in order for enabling the boot sequence to transfer control to a flash image.
Any illegal vector table start address value forces the boot sequence to call the boot loader.
Note that if any other legal vector table start address value than 0x0 is selected the PRCM:WARMRESET.WR_TO_PINRESET must be set to 1.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
