btcven/cortex-debug-cc26xx-cc13xx/data/cc2640r2f.svd
0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>[29:29] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>COMP</name>
              <description>[28:2] Comparison address.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[1:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Compare and remap enable comparator 1. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 1 disabled
0x1: Compare and remap for comparator 1 enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP2</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Comparator 2</description>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>[31:30] This selects what happens when the COMP address is matched. Address remapping only takes place for the 0x0 setting.

0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>[29:29] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>COMP</name>
              <description>[28:2] Comparison address.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[1:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Compare and remap enable comparator 2. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 2 disabled
0x1: Compare and remap for comparator 2 enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP3</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Comparator 3</description>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>[31:30] This selects what happens when the COMP address is matched. Address remapping only takes place for the 0x0 setting.

0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>[29:29] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>COMP</name>
              <description>[28:2] Comparison address.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[1:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Compare and remap enable comparator 3. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 3 disabled
0x1: Compare and remap for comparator 3 enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP4</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Comparator 4</description>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>[31:30] This selects what happens when the COMP address is matched. Address remapping only takes place for the 0x0 setting.

