btcven/cortex-debug-cc26xx-cc13xx/data/cc2640r2f.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FCFG1</name>
      <baseAddress>0x50001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Factory configuration area (FCFG1)</description>
      <registers>
        <register>
          <name>MISC_CONF_1</name>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <description>Misc configurations</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DEVICE_MINOR_REV</name>
              <description>[7:0] HW minor revision number (a value of 0xFF shall be treated equally to 0x00).
Any test of this field by SW should be implemented as a 'greater or equal' comparison as signed integer.
Value may change without warning.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFF00</resetValue>
        </register>
        <register>
          <name>MISC_CONF_2</name>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HPOSC_COMP_P3</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFF00</resetValue>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV5</name>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>[23:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>[18:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RESERVED</name>
              <description>[13:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>[6:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV6</name>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>[23:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>[18:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RESERVED</name>
              <description>[13:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>[6:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV10</name>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>[23:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>[18:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RESERVED</name>
              <description>[13:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>[6:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV12</name>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>[23:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>[18:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RESERVED</name>
              <description>[13:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>[6:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV15</name>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>[23:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>[18:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RESERVED</name>
              <description>[13:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>[6:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV30</name>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>[23:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>[18:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RESERVED</name>
              <description>[13:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>[6:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV5</name>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>[27:12] Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>[11:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV6</name>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>[27:12] Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>[11:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV10</name>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>[27:12] Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>[11:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV12</name>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>[27:12] Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>[11:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV15</name>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>[27:12] Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>[11:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV30</name>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>[27:12] Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>[11:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CONFIG_MISC_ADC_DIV5</name>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>RSSI_OFFSET</name>
              <description>[16:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>QUANTCTLTHRES</name>
              <description>[8:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DACTRIM</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
